# === Taps ===
tap "hashicorp/tap"

# === Build dependencies (pyenv/python) ===
brew "gcc"
brew "openssl"
brew "readline"
brew "sqlite3"
brew "xz"
brew "zlib"
brew "tcl-tk@8"        # needed by pyenv for tkinter
brew "libb2"           # blake2 hashing, python build dep

# === Shell & terminal ===
brew "tmux"
brew "starship"
brew "direnv"
brew "fzf"
brew "ripgrep"

# === CLI tools ===
brew "jq"
brew "httpie"
brew "tlrc"            # tldr client in Rust
brew "ncdu"
brew "gh"

# === Python ===
brew "uv"

# === Data & databases ===
brew "pgcli"
brew "sqlcmd"
brew "snowflake-cli"

# === Cloud & infra ===
brew "azure-cli"
brew "hashicorp/tap/terraform"
brew "tflint"

# === Languages & runtimes ===
brew "node"
brew "fnm"
brew "kona"
brew "rlwrap"          # readline wrapper for kona REPL

# === Dev platforms ===
brew "coder"
